system/controlDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object controlDict;
}

application icoFoam;

Co1
{
  type CourantNo;
} 	//libs		("/home/lswanson/OpenFOAM/lswanson-6/platforms/linux64GccDPInt32Opt/lib/libParabolicInletVelocity.so");

startFrom startTime;

startTime 0;

stopAt endTime;

endTime 1;

deltaT 0.0002;   //0.0005 doesn't converge  Liam used 0.000005

writeControl timeStep;

writeInterval 1000;

purgeWrite 0;

writeFormat ascii;

writePrecision 6;

writeCompression no;
timeFormat general;

timePrecision 6;

runTimeModifiable yes;
